docs/images/README.org
* Source and lincense information about these images

  Pictures (camera or screenshot) by Marc Ihm, subject to MIT License.

* How to produce screenshots

  In full screen with: stty size = 24 x 81 (o.ä.)

  hw listen richter c blues --add-scales chord-i,chord-iv,chord-v --display chart-scales --comment note --screenshot

  In full screen with: stty size = 30 x 104 (o.ä.)
  
  harpwise quiz choose

  und dann "describe-all" und "keep-tempo"
  
* How to produce ascii-casts as gifs

  Terminal:
  - stty size = 24 x 81 (o.ä.)

  Preparation:
  - in .bashrc:
    - PS1="\$ "
    - alias harpwise='/home/ihm/git/harpwise/harpwise'
  - in ~/git/harpwise/config.ini: difficulty auf 0

  Tools:
  - asciinema (from repositories)
  - agg  (https://github.com/asciinema/agg)
    
** Listen
   
   asciinema rec -t "harpwise listen" --overwrite harpwise-listen.cast

   - harpwise listen c

   - Spielen
     - -4 +4 -4 -3 +3 +2 -1 -3 -2
   - Help
     - j
   - Journal
     - -4 +4 -4 -3 +3 +2 -1 -3 -2
   - ctrl-c

   edit cast-file remove everything after "exit on ctrl-c"
   
   ~/.cargo/bin/agg --line-height 1.2 --font-size 14 harpwise-listen.cast harpwise-listen.gif

** quiz
   
   asciinema rec -t "harpwise quiz" --overwrite harpwise-quiz.cast

   - harpwise quiz choose --difficulty easy
     
   Then:
   - 'describe' (choose by typing 'down')
     - do not scroll
   - 'hear-key' (three times 'right')
     - ',solve'
     - ctrl-z
     - tab
   - 'players' (choose by typing name)
     - wrong try
     - ',solve'
     - ctrl-z
     - tab
   - 'keep-tempo' (choose by typing name)
   - ctrl-c

   edit cast-file and remove everything after "exit on ctrl-c"
       
   .cargo/bin/agg --line-height 1.2 --font-size 14 harpwise-quiz.cast harpwise-quiz.gif
