docs/_html/images/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-20 Sat 08:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="notebook-marc" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org54278d9" class="outline-2">
<h2 id="org54278d9">Source and lincense information about these images</h2>
<div class="outline-text-2" id="text-org54278d9">
<p>
Pictures (camera or screenshot) by Marc Ihm, subject to MIT License.
</p>
</div>
</div>
<div id="outline-container-org08b77f2" class="outline-2">
<h2 id="org08b77f2">How to produce screenshots</h2>
<div class="outline-text-2" id="text-org08b77f2">
<p>
In full screen with: stty size = 24 x 81 (o.ä.)
</p>

<p>
hw listen richter c blues &#x2013;add-scales chord-i,chord-iv,chord-v &#x2013;display chart-scales &#x2013;comment note &#x2013;screenshot
</p>

<p>
In full screen with: stty size = 30 x 104 (o.ä.)
</p>

<p>
harpwise quiz choose
</p>

<p>
und dann "describe-all" und "keep-tempo"
</p>
</div>
</div>
<div id="outline-container-orge2e0e59" class="outline-2">
<h2 id="orge2e0e59">How to produce ascii-casts as gifs</h2>
<div class="outline-text-2" id="text-orge2e0e59">
<p>
Terminal:
</p>
<ul class="org-ul">
<li>stty size = 24 x 81 (o.ä.)</li>
</ul>

<p>
Preparation:
</p>
<ul class="org-ul">
<li>in .bashrc:
<ul class="org-ul">
<li>PS1="\$ "</li>
<li>alias harpwise='/home/ihm/git/harpwise/harpwise'</li>
</ul></li>
<li>in ~/git/harpwise/config.ini: difficulty auf 0</li>
</ul>

<p>
Tools:
</p>
<ul class="org-ul">
<li>asciinema (from repositories)</li>
<li>agg  (<a href="https://github.com/asciinema/agg">https://github.com/asciinema/agg</a>)</li>
</ul>
</div>
<div id="outline-container-org776ea1d" class="outline-3">
<h3 id="org776ea1d">Listen</h3>
<div class="outline-text-3" id="text-org776ea1d">
<p>
asciinema rec -t "harpwise listen" &#x2013;overwrite harpwise-listen.cast
</p>

<ul class="org-ul">
<li>harpwise listen c</li>

<li>Spielen
<ul class="org-ul">
<li>-4 +4 -4 -3 +3 +2 -1 -3 -2</li>
</ul></li>
<li>Help
<ul class="org-ul">
<li>j</li>
</ul></li>
<li>Journal
<ul class="org-ul">
<li>-4 +4 -4 -3 +3 +2 -1 -3 -2</li>
</ul></li>
<li>ctrl-c</li>
</ul>

<p>
edit cast-file remove everything after "exit on ctrl-c"
</p>

<p>
~/.cargo/bin/agg &#x2013;line-height 1.2 &#x2013;font-size 14 harpwise-listen.cast harpwise-listen.gif
</p>
</div>
</div>
<div id="outline-container-org05b5d6a" class="outline-3">
<h3 id="org05b5d6a">quiz</h3>
<div class="outline-text-3" id="text-org05b5d6a">
<p>
asciinema rec -t "harpwise quiz" &#x2013;overwrite harpwise-quiz.cast
</p>

<ul class="org-ul">
<li>harpwise quiz choose &#x2013;difficulty easy</li>
</ul>

<p>
Then:
</p>
<ul class="org-ul">
<li>'describe' (choose by typing 'down')
<ul class="org-ul">
<li>do not scroll</li>
</ul></li>
<li>'hear-key' (three times 'right')
<ul class="org-ul">
<li>',solve'</li>
<li>ctrl-z</li>
<li>tab</li>
</ul></li>
<li>'players' (choose by typing name)
<ul class="org-ul">
<li>wrong try</li>
<li>',solve'</li>
<li>ctrl-z</li>
<li>tab</li>
</ul></li>
<li>'keep-tempo' (choose by typing name)</li>
<li>ctrl-c</li>
</ul>

<p>
edit cast-file and remove everything after "exit on ctrl-c"
</p>

<p>
.cargo/bin/agg &#x2013;line-height 1.2 &#x2013;font-size 14 harpwise-quiz.cast harpwise-quiz.gif
</p>
</div>
</div>
</div>
</div>
</body>
</html>
